GopalSaraf/Practicals/PSDL/include/proc/pic16hv610.h
extern volatile IOCbits_t IOCbits __at(0x096);
// bitfield macros
#define _IOC_IOCA0_POSN                                     0x0
#define _IOC_IOCA0_POSITION                                 0x0
#define _IOC_IOCA0_SIZE                                     0x1
#define _IOC_IOCA0_LENGTH                                   0x1
#define _IOC_IOCA0_MASK                                     0x1
#define _IOC_IOCA1_POSN                                     0x1
#define _IOC_IOCA1_POSITION                                 0x1
#define _IOC_IOCA1_SIZE                                     0x1
#define _IOC_IOCA1_LENGTH                                   0x1
#define _IOC_IOCA1_MASK                                     0x2
#define _IOC_IOCA2_POSN                                     0x2
#define _IOC_IOCA2_POSITION                                 0x2
#define _IOC_IOCA2_SIZE                                     0x1
#define _IOC_IOCA2_LENGTH                                   0x1
#define _IOC_IOCA2_MASK                                     0x4
#define _IOC_IOCA3_POSN                                     0x3
#define _IOC_IOCA3_POSITION                                 0x3
#define _IOC_IOCA3_SIZE                                     0x1
#define _IOC_IOCA3_LENGTH                                   0x1
#define _IOC_IOCA3_MASK                                     0x8
#define _IOC_IOCA4_POSN                                     0x4
#define _IOC_IOCA4_POSITION                                 0x4
#define _IOC_IOCA4_SIZE                                     0x1
#define _IOC_IOCA4_LENGTH                                   0x1
#define _IOC_IOCA4_MASK                                     0x10
#define _IOC_IOCA5_POSN                                     0x5
#define _IOC_IOCA5_POSITION                                 0x5
#define _IOC_IOCA5_SIZE                                     0x1
#define _IOC_IOCA5_LENGTH                                   0x1
#define _IOC_IOCA5_MASK                                     0x20
#define _IOC_IOC0_POSN                                      0x0
#define _IOC_IOC0_POSITION                                  0x0
#define _IOC_IOC0_SIZE                                      0x1
#define _IOC_IOC0_LENGTH                                    0x1
#define _IOC_IOC0_MASK                                      0x1
#define _IOC_IOC1_POSN                                      0x1
#define _IOC_IOC1_POSITION                                  0x1
#define _IOC_IOC1_SIZE                                      0x1
#define _IOC_IOC1_LENGTH                                    0x1
#define _IOC_IOC1_MASK                                      0x2
#define _IOC_IOC2_POSN                                      0x2
#define _IOC_IOC2_POSITION                                  0x2
#define _IOC_IOC2_SIZE                                      0x1
#define _IOC_IOC2_LENGTH                                    0x1
#define _IOC_IOC2_MASK                                      0x4
#define _IOC_IOC3_POSN                                      0x3
#define _IOC_IOC3_POSITION                                  0x3
#define _IOC_IOC3_SIZE                                      0x1
#define _IOC_IOC3_LENGTH                                    0x1
#define _IOC_IOC3_MASK                                      0x8
#define _IOC_IOC4_POSN                                      0x4
#define _IOC_IOC4_POSITION                                  0x4
#define _IOC_IOC4_SIZE                                      0x1
#define _IOC_IOC4_LENGTH                                    0x1
#define _IOC_IOC4_MASK                                      0x10
#define _IOC_IOC5_POSN                                      0x5
#define _IOC_IOC5_POSITION                                  0x5
#define _IOC_IOC5_SIZE                                      0x1
#define _IOC_IOC5_LENGTH                                    0x1
#define _IOC_IOC5_MASK                                      0x20

// Register: SRCON0
#define SRCON0 SRCON0
extern volatile unsigned char           SRCON0              __at(0x099);
#ifndef _LIB_BUILD
asm("SRCON0 equ 099h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SRCLKEN                :1;
        unsigned                        :1;
        unsigned PULSR                  :1;
        unsigned PULSS                  :1;
        unsigned C2REN                  :1;
        unsigned C1SEN                  :1;
        unsigned SR                     :2;
    };
    struct {
        unsigned                        :6;
        unsigned SR0                    :1;
        unsigned SR1                    :1;
    };
} SRCON0bits_t;
extern volatile SRCON0bits_t SRCON0bits __at(0x099);
// bitfield macros
#define _SRCON0_SRCLKEN_POSN                                0x0
#define _SRCON0_SRCLKEN_POSITION                            0x0
#define _SRCON0_SRCLKEN_SIZE                                0x1
#define _SRCON0_SRCLKEN_LENGTH                              0x1
#define _SRCON0_SRCLKEN_MASK                                0x1
#define _SRCON0_PULSR_POSN                                  0x2
#define _SRCON0_PULSR_POSITION                              0x2
#define _SRCON0_PULSR_SIZE                                  0x1
#define _SRCON0_PULSR_LENGTH                                0x1
#define _SRCON0_PULSR_MASK                                  0x4
#define _SRCON0_PULSS_POSN                                  0x3
#define _SRCON0_PULSS_POSITION                              0x3
#define _SRCON0_PULSS_SIZE                                  0x1
#define _SRCON0_PULSS_LENGTH                                0x1
#define _SRCON0_PULSS_MASK                                  0x8
#define _SRCON0_C2REN_POSN                                  0x4
#define _SRCON0_C2REN_POSITION                              0x4
#define _SRCON0_C2REN_SIZE                                  0x1
#define _SRCON0_C2REN_LENGTH                                0x1
#define _SRCON0_C2REN_MASK                                  0x10
#define _SRCON0_C1SEN_POSN                                  0x5
#define _SRCON0_C1SEN_POSITION                              0x5
#define _SRCON0_C1SEN_SIZE                                  0x1
#define _SRCON0_C1SEN_LENGTH                                0x1
#define _SRCON0_C1SEN_MASK                                  0x20
#define _SRCON0_SR_POSN                                     0x6
#define _SRCON0_SR_POSITION                                 0x6
#define _SRCON0_SR_SIZE                                     0x2
#define _SRCON0_SR_LENGTH                                   0x2
#define _SRCON0_SR_MASK                                     0xC0
#define _SRCON0_SR0_POSN                                    0x6
#define _SRCON0_SR0_POSITION                                0x6
#define _SRCON0_SR0_SIZE                                    0x1
#define _SRCON0_SR0_LENGTH                                  0x1
#define _SRCON0_SR0_MASK                                    0x40
#define _SRCON0_SR1_POSN                                    0x7
#define _SRCON0_SR1_POSITION                                0x7
#define _SRCON0_SR1_SIZE                                    0x1
#define _SRCON0_SR1_LENGTH                                  0x1
#define _SRCON0_SR1_MASK                                    0x80

// Register: SRCON1
#define SRCON1 SRCON1
extern volatile unsigned char           SRCON1              __at(0x09A);
#ifndef _LIB_BUILD
asm("SRCON1 equ 09Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned SRCS                   :2;
    };
    struct {
        unsigned                        :6;
        unsigned SRCS0                  :1;
        unsigned SRCS1                  :1;
    };
} SRCON1bits_t;
extern volatile SRCON1bits_t SRCON1bits __at(0x09A);
// bitfield macros
#define _SRCON1_SRCS_POSN                                   0x6
#define _SRCON1_SRCS_POSITION                               0x6
#define _SRCON1_SRCS_SIZE                                   0x2
#define _SRCON1_SRCS_LENGTH                                 0x2
#define _SRCON1_SRCS_MASK                                   0xC0
#define _SRCON1_SRCS0_POSN                                  0x6
#define _SRCON1_SRCS0_POSITION                              0x6
#define _SRCON1_SRCS0_SIZE                                  0x1
#define _SRCON1_SRCS0_LENGTH                                0x1
#define _SRCON1_SRCS0_MASK                                  0x40
#define _SRCON1_SRCS1_POSN                                  0x7
#define _SRCON1_SRCS1_POSITION                              0x7
#define _SRCON1_SRCS1_SIZE                                  0x1
#define _SRCON1_SRCS1_LENGTH                                0x1
#define _SRCON1_SRCS1_MASK                                  0x80

